stage1-forth-bytecode/stage1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-02 Sun 02:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machine independent part of the simple Forth interpreter</title>
<meta name="author" content="Robert Kovacsics (rmk35)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Machine independent part of the simple Forth interpreter</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9ae91d8">1. <span class="todo TODO">TODO</span> Forth</a>
<ul>
<li><a href="#orgeed5cac">1.1. <span class="todo TODO">TODO</span> Input</a>
<ul>
<li><a href="#org6093096">1.1.1. Words</a></li>
<li><a href="#org6935181">1.1.2. Numbers</a></li>
</ul>
</li>
<li><a href="#orgd8dbe63">1.2. <span class="todo TODO">TODO</span> Compiling</a></li>
<li><a href="#org5544b2d">1.3. <span class="todo TODO">TODO</span> REPL</a></li>
<li><a href="#org5cf8647">1.4. <span class="todo TODO">TODO</span> DOES&gt;</a></li>
<li><a href="#org9369497">1.5. <span class="todo TODO">TODO</span> Brave New Words</a></li>
<li><a href="#orgedcd9b7">1.6. <span class="todo TODO">TODO</span> Control Words</a></li>
<li><a href="#org1c8b105">1.7. <span class="todo TODO">TODO</span> Comments</a></li>
</ul>
</li>
<li><a href="#orgfdd8917">2. <span class="todo TODO">TODO</span> Change</a></li>
<li><a href="#orgadee56a">3. <span class="todo TODO">TODO</span> Testing</a></li>
<li><a href="#orgc4b9ace">4. <span class="todo TODO">TODO</span> After REPL</a></li>
<li><a href="#org41bc4b6">5. <span class="todo TODO">TODO</span> Forth Assembler</a>
<ul>
<li><a href="#org747731c">5.1. ;CODE</a></li>
</ul>
</li>
<li><a href="#org6832c89">6. <span class="todo TODO">TODO</span> Ideas</a></li>
<li><a href="#org10ef4c8">7. <span class="todo TODO">TODO</span> Naming</a></li>
<li><a href="#orgc555aea">8. <span class="todo TODO">TODO</span> Partial Recursive Functions (PRF) </a></li>
<li><a href="#orgb861b19">9. <span class="todo TODO">TODO</span> Terminal on host with simple-forth.c?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9ae91d8" class="outline-2">
<h2 id="org9ae91d8"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> Forth</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeed5cac" class="outline-3">
<h3 id="orgeed5cac"><span class="section-number-3">1.1.</span> <span class="todo TODO">TODO</span> Input</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6093096" class="outline-4">
<h4 id="org6093096"><span class="section-number-4">1.1.1.</span> Words</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
TODO: backspace (or perhaps with a modified key?)
</p>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"LOWER"</span>, _
  <span class="org-keyword">.fw</span> DUP, LIT, L,'A', U_LESS_THAN
  <span class="org-keyword">.fw</span> OVER, LIT, L,'Z', U_GREATER_THAN
  <span class="org-keyword">.fw</span> OR, INVERT, ZBRANCH, L,(1f-.)
  <span class="org-keyword">.fw</span> LIT, L,32, ADD
<span class="org-function-name">1</span>:.fw EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: LOWER ( char -- char )
  dup char A U&lt; over char Z U&gt;
  or invert if 32 + then ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"CHAR\x3d"</span>, CHAR_EQUAL
  <span class="org-keyword">.fw</span> TWO_DUP, EQUAL, ZBRANCH, L,(1f-.)
  <span class="org-keyword">.fw</span> TWO_DROP, TRUE, EXIT
<span class="org-function-name">1</span>:.fw OVER, LIT, L,33, U_LESS_THAN
  <span class="org-keyword">.fw</span> OVER, LIT, L,33, U_LESS_THAN
  <span class="org-keyword">.fw</span> AND, ZBRANCH, L,(2f-.)
  <span class="org-keyword">.fw</span> TWO_DROP, TRUE, EXIT
<span class="org-function-name">2</span>:.fw LOWER, SWAP, LOWER, EQUAL
  <span class="org-keyword">.fw</span> ZBRANCH, L,(3f-.)
  <span class="org-keyword">.fw</span> TRUE, EXIT
<span class="org-function-name">3</span>:.fw FALSE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: CHAR=' ( char char -- -1|0 )
  2dup = if 2drop true exit then
  over 33 U&lt; over 33 U&lt; and if 2drop true exit then
  lower swap lower = if true exit then
  false ;
</pre>
</div>
</td></tr></tbody></table>

<p>
TODO: transient region
</p>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"WORD\x27"</span>, WORD_NEW
  <span class="org-keyword">.fw</span> HERE, SWAP, LIT, L,0
<span class="org-function-name">WORD_SKIP</span>:
  <span class="org-keyword">.fw</span> DROP, KEY, TWO_DUP, CHAR_EQUAL
  <span class="org-keyword">.fw</span> INVERT, ZBRANCH, L,(WORD_SKIP-.)
<span class="org-function-name">WORD_LOOP</span>:
  <span class="org-keyword">.fw</span> DUP, C_COMMA, OVER, CHAR_EQUAL
  <span class="org-keyword">.fw</span> ZBRANCH, L,(WORD_CONT-.)
  <span class="org-keyword">.fw</span> DROP, CHAR_SIZE, NEGATE, ALLOT
  <span class="org-keyword">.fw</span> HERE, OVER, SUB, LIT, L,0, C_COMMA
  <span class="org-keyword">.fw</span> LIT, L,-1, OVER, SUB, ALLOT, EXIT
<span class="org-function-name">WORD_CONT</span>:
  <span class="org-keyword">.fw</span> KEY, BRANCH, L,(WORD_LOOP-.)
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: WORD' ( char "&lt;chars&gt;ccc&lt;char&gt;" -- c-addr u )
  here swap
  0 begin drop key 2dup char= until
  begin \ start char key
    dup C,
    over char= if \ start char
      drop char-size negate allot
      here over - 0 C,
      -1 over - allot exit
    then
    key
  again ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"WORD"</span>, WORD
  <span class="org-keyword">.fw</span> HERE, SWAP, CELL_SIZE, ALLOT,
  <span class="org-keyword">.fw</span> WORD_NEW, ROT, STORE
  <span class="org-keyword">.fw</span> CELL_SIZE, NEGATE, ALLOT
  <span class="org-keyword">.fw</span> CELL_SIZE, SUB, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: WORD ( char "&lt;chars&gt;ccc&lt;char&gt;" -- c-addr u )
  here swap cell-size allot
  word' rot \ c-addr u1 len-pos
  ! \ c-addr
  cell-size negate allot \ deallocate len
  cell-size - ; \ make addr point to len
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>
