stage1-forth-bytecode/stage1.html

<div id="outline-container-org6935181" class="outline-4">
<h4 id="org6935181"><span class="section-number-4">1.1.2.</span> Numbers</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
If the character is less than '0', or between '9' and 'A' (or 'Z' and
'a'), then it underflows, and will end up being greater than BASE.
</p>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"CHAR-&gt;DIGIT"</span>, CHAR_TO_DIGIT
  <span class="org-keyword">.fw</span> LIT, L,'0', SUB
  <span class="org-keyword">.fw</span> DUP, LIT, L,9, U_GREATER_THAN, ZBRANCH, L,(C_TO_D_END-.)
  <span class="org-keyword">.fw</span> LIT, L,('A'-'9'-1), SUB
  <span class="org-keyword">.fw</span> DUP, LIT, L,10, U_LESS_THAN, ZBRANCH, L,(C_TO_D_A-.)
  <span class="org-keyword">.fw</span> LIT, L,10, SUB
<span class="org-function-name">C_TO_D_A</span>:
  <span class="org-keyword">.fw</span> DUP, LIT, L,35, U_GREATER_THAN, ZBRANCH, L,(C_TO_D_END-.)
  <span class="org-keyword">.fw</span> LIT, L,32, SUB
  <span class="org-keyword">.fw</span> DUP, LIT, L,10, U_LESS_THAN, ZBRANCH, L,(C_TO_D_END-.)
  <span class="org-keyword">.fw</span> LIT, L,10, SUB
<span class="org-function-name">C_TO_D_END</span>:
  <span class="org-keyword">.fw</span> EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: CHAR-&gt;DIGIT ( char -- digit )
  char 0 -
  dup 9 U&gt; if
    7 - \ 9 : ; &lt; = &gt; ? @ A
    dup 10 U&lt; if 10 - then
    dup 35 U&gt; if
      32 - \ A-Z [ \ ] ^ _ ` a-z
      dup 10 U&lt; if 10 - then
    then
  then ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.data</span>
<span class="org-function-name">BASE_LOC</span>: .cell 10
<span class="org-keyword">.text</span>
<span class="org-keyword">.fdef</span> <span class="org-string">"BASE"</span>, BASE
  <span class="org-keyword">.fw</span> LIT, L,BASE_LOC, EXIT
<span class="org-keyword">.fdef</span> <span class="org-string">"DECIMAL"</span>, DECIMAL
  <span class="org-keyword">.fw</span> LIT, L,10, BASE, STORE, EXIT
<span class="org-keyword">.fdef</span> <span class="org-string">"&gt;NUMBER"</span>, TO_NUMBER
  <span class="org-keyword">.fw</span> OVER, ADD, DUP, TO_R, SWAP
  <span class="org-keyword">.fw</span> TWO_TO_R
<span class="org-function-name">TO_NUM_LOOP</span>:
  <span class="org-keyword">.fw</span> R_FETCH, C_FETCH, CHAR_TO_DIGIT, DUP
  <span class="org-keyword">.fw</span> BASE, FETCH, U_LESS_THAN
  <span class="org-keyword">.fw</span> ZBRANCH, L,(TO_NUM_ELSE-.)
  <span class="org-keyword">.fw</span> SWAP, BASE, FETCH, STAR, ADD
  <span class="org-keyword">.fw</span> BRANCH, L,(TO_NUM_NEXT-.)
<span class="org-function-name">TO_NUM_ELSE</span>:
  <span class="org-keyword">.fw</span> DROP, R_FETCH, TWO_R_DROP, R_FROM
  <span class="org-keyword">.fw</span> OVER, SUB,  EXIT
<span class="org-function-name">TO_NUM_NEXT</span>:
  <span class="org-keyword">.fw</span> R_FROM, LIT, L,1, ADD, TO_R
  <span class="org-keyword">.fw</span> TWO_R_FETCH, EQUAL
  <span class="org-keyword">.fw</span> ZBRANCH, L,(TO_NUM_LOOP-.)
  <span class="org-keyword">.fw</span> TWO_R_DROP
  <span class="org-keyword">.fw</span> R_FROM, LIT, L,0
  <span class="org-keyword">.fw</span> EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">variable BASE 10 BASE !
: &gt;NUMBER ( ud1 c-addr1 u1 -- ud2 c-addr2 u2 )
  over + dup &gt;R swap \ ud1 c-addr1+u1 c-addr1; R: c-addr1+u1
  do \ ud1; loops with  c-addr1 &lt;= I &lt; c-addr1+u1
    I C@ char-&gt;digit dup BASE @ U&lt; if \ ud1 digit
      swap BASE @ * +
    else \ ud2 digit
      drop I unloop R&gt; over - exit \ ud2 c-addr2 u2
    then
  loop
  R&gt; 0 ;
</pre>
</div>
</td></tr></tbody></table>

<p>
(We also need a way of converting signed numbers, and numbers in other
bases too, according to ยง3.4.1.3.
</p>

<div class="org-src-container">
<pre class="src src-forth">: NUMBER ( ud1 c-addr u1 -- number c-addr u2 )
  BASE @ &gt;R
  over @ ''' = if parse-char then
  over @ case
    '#' of 1 + decimal endof
    '$' of 1 + hex endof
    '%' of 1 + binary endof
  endcase
  dup 0 = if 1+ swap 1- exit ( to indicate that we failed to parse ) then
  over @ '-' = &gt;R
  R@ if 1+ then
  dup 0 = if 1+ swap -1 exit ( to indicate that we failed to parse ) then
  &gt;number
  rot R&gt; if negate then -rot
  R&gt; BASE !
  ;

: PARSE-CHAR ( ud1 c-addr u1 -- ud2 c-addr u2 )
  dup 3 = if
    drop 1+ dup C@ rot + swap 2 + 0
  then
  ;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8dbe63" class="outline-3">
<h3 id="orgd8dbe63"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> Compiling</h3>
<div class="outline-text-3" id="text-1-2">
<p>
See ยง3.4 of the <a href="https://www.taygeta.com/forth/dpans3.htm#3.4">ANSI Forth manual</a>.
</p>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"BL"</span>, BL
  <span class="org-keyword">.fw</span> LIT, L,' ', EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: BL ( -- char ) 32 ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"\x27"</span>, TICK
  <span class="org-keyword">.fw</span> BL, WORD_NEW, FIND_NEW, DROP, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: TICK ( "&lt;spaces&gt;name" -- xt )
  bl word' find' drop ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"OK"</span>, OK
  <span class="org-keyword">.fw</span> LIT, L,'O', EMIT, LIT, L,'k'
  <span class="org-keyword">.fw</span> EMIT, BL, EMIT, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: OK
  bl emit char O emit char k emit bl emit ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"ERROR"</span>, ERROR
  <span class="org-keyword">.fw</span> LIT, L,'E', EMIT, LIT, L,'r', EMIT
  <span class="org-keyword">.fw</span> LIT, L,'r', EMIT, BL, EMIT, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: ERROR
  char E emit char r emit char r emit bl emit ;
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>
