stage1-forth-bytecode/stage1.html

<div id="outline-container-org5544b2d" class="outline-3">
<h3 id="org5544b2d"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> REPL</h3>
<div class="outline-text-3" id="text-1-3">
<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">// </span><span class="org-comment">TODO: Different interpretation modes</span>
<span class="org-keyword">.fdef</span> <span class="org-string">"COMPILE\x2c"</span>, COMPILE_COMMA
  <span class="org-keyword">.fw</span> COMMA, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">TODO
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"QUIT-FOUND"</span>, QUIT_FOUND
  <span class="org-keyword">.fw</span> NIP, LIT, L,-1, EQUAL, STATE
  <span class="org-keyword">.fw</span> FETCH, AND, ZBRANCH, L,(Q_F_EX-.)
  <span class="org-keyword">.fw</span> COMPILE_COMMA, BRANCH, L,(Q_F_END-.)
<span class="org-function-name">Q_F_EX</span>:
  <span class="org-keyword">.fw</span> EXECUTE
<span class="org-function-name">Q_F_END</span>:
  <span class="org-keyword">.fw</span> OK, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: QUIT_FOUND ( xt u -1|1 -- )
  nip -1 = state @ and if \ Compiling
    compiling, else execute then
  ok ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef1</span> <span class="org-string">"LITERAL"</span>, LITERAL, -1 <span class="org-comment-delimiter">/* </span><span class="org-comment">immediate */</span>
  <span class="org-keyword">.fw</span> LIT, LIT, COMMA
  <span class="org-keyword">.fw</span> COMMA, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: LITERAL ( x -- )
  ' lit compiling, , ; \ TODO
: LITERAL ['] lit , ; IMMEDIATE
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"QUIT-NOT-FOUND"</span>, QUIT_NOT_FOUND
  <span class="org-keyword">.fw</span> NROT, TO_NUMBER, LIT, L,0 <span class="org-comment-delimiter">/* </span><span class="org-comment">TODO: http://forth-standard.org/standard/usage#subsection.3.4.1.3 */</span>
  <span class="org-keyword">.fw</span> EQUAL, ZBRANCH, L,(Q_N_F_ELSE-.)
  <span class="org-keyword">.fw</span> DROP, STATE, FETCH, ZBRANCH, L,(Q_N_F_END-.)
  <span class="org-keyword">.fw</span> LITERAL
  <span class="org-keyword">.fw</span> BRANCH, L,(Q_N_F_END-.)
<span class="org-function-name">Q_N_F_ELSE</span>:
  <span class="org-keyword">.fw</span> TWO_DROP, ERROR, EXIT
<span class="org-function-name">Q_N_F_END</span>:
  <span class="org-keyword">.fw</span> OK, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: QUIT_NOT_FOUND ( c-addr u 0 -- )
  rot rot &gt;number 0 = if \ TODO negative numbers
    drop state @ if \ Compiling
      literal
    then
  else
    2drop error exit
  then
  ok ;
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"QUIT"</span>, QUIT
<span class="org-function-name">QUIT_LOOP</span>:
  <span class="org-keyword">.fw</span> BL, WORD_NEW, DUP, NROT
  <span class="org-keyword">.fw</span> FIND_NEW, ROT, SWAP
  <span class="org-keyword">.fw</span> DUP, ZBRANCH, L,(QUIT_N_F-.)
  <span class="org-keyword">.fw</span> QUIT_FOUND, BRANCH, L,(QUIT_LOOP-.)
<span class="org-function-name">QUIT_N_F</span>:
  <span class="org-keyword">.fw</span> QUIT_NOT_FOUND, BRANCH, L,(QUIT_LOOP-.)
  <span class="org-keyword">.fw</span> EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: QUIT ( -- )
  \ TODO: Set up value and return stacks
  begin
    bl word' dup rot rot \ u c-addr u
    find' rot swap \ c-addr u -1|0|1
    dup if quit_found else
	  quit_not_found then
    ok
  again ;
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>

<div id="outline-container-org5cf8647" class="outline-3">
<h3 id="org5cf8647"><span class="section-number-3">1.4.</span> <span class="todo TODO">TODO</span> DOES&gt;</h3>
</div>
<div id="outline-container-org9369497" class="outline-3">
<h3 id="org9369497"><span class="section-number-3">1.5.</span> <span class="todo TODO">TODO</span> Brave New Words</h3>
<div class="outline-text-3" id="text-1-5">
<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef1</span> <span class="org-string">"["</span>, LBRAC,-1 <span class="org-comment-delimiter">/* </span><span class="org-comment">immediate */</span>
  <span class="org-keyword">.fw</span> LIT, L,0, STATE, STORE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: [ false state ! IMMEDIATE
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef</span> <span class="org-string">"]"</span>, RBRAC
  <span class="org-keyword">.fw</span> LIT, L,-1, STATE, STORE, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">: ] true state !
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">// </span><span class="org-comment">TODO: SUBROUTINE .fdef "\x3a", COLON</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">TODO: SUBROUTINE   .fw CREATE</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">TODO: SUBROUTINE   .fw LIT, forth_interpreter, COMMA</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">TODO: SUBROUTINE   .fw LATEST, FETCH, HIDE</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">TODO: SUBROUTINE   .fw RBRAC, EXIT</span>
<span class="org-keyword">.fdef</span> <span class="org-string">"\x3a"</span>, COLON
  <span class="org-keyword">.fw</span> CREATE
  <span class="org-keyword">.fw</span> LATEST, FETCH, HIDE
  <span class="org-keyword">.fw</span> RBRAC, EXIT
  # TODO
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">
</pre>
</div>
</td></tr></tbody></table>

<table class="harmonica-table"><thead><tr><td>Assembly</td><td>Forth</td></tr></thead><tbody><tr><td>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fdef1</span> <span class="org-string">"\x3b"</span>, SEMICOLON, -1 <span class="org-comment-delimiter">/* </span><span class="org-comment">immediate */</span>
  <span class="org-keyword">.fw</span> LIT, L,EXIT, COMMA
  <span class="org-keyword">.fw</span> LATEST, FETCH, HIDE, LBRAC, EXIT
</pre>
</div>
</td><td>
<div class="org-src-container">
<pre class="src src-forth">TODO
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>

<div id="outline-container-orgedcd9b7" class="outline-3">
<h3 id="orgedcd9b7"><span class="section-number-3">1.6.</span> <span class="todo TODO">TODO</span> Control Words</h3>
<div class="outline-text-3" id="text-1-6">
<p>
TODO explain, especially as we don't have comments yet
</p>
<ul class="org-ul">
<li>Note, not using compile, for [']</li>
<li>Note, literal defined previously
<ul class="org-ul">
<li>But ['] and LITERAL are very similar
<ul class="org-ul">
<li>Can we use LIT as ['], it only needs compilation semantics?
<ul class="org-ul">
<li>Not quite, it doesn't push XT, it pushes entry-&gt;interpreter
<ul class="org-ul">
<li>Perhaps swap the meaning of XT back?</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-forth">: POSTPONE ' compile, ; IMMEDIATE \ Can place elsewhere TODO
</pre>
</div>

<div class="org-src-container">
<pre class="src src-forth">: ['] lit lit , ' , ; IMMEDIATE
: IF
  ['] BRANCH, compile,
  HERE 0 , ; IMMEDIATE
: THEN
  HERE over - swap ! ; IMMEDIATE
: ELSE
  [']BRANCH, compile,
  HERE swap 0 ,
  HERE over - swap ! ; IMMEDIATE
</pre>
</div>

<div class="org-src-container">
<pre class="src src-forth">TODO TO TEST

: BEGIN
  HERE ; IMMEDIATE
: AGAIN
  [']BRANCH, compile,
  HERE - , ; IMMEDIATE
: UNTIL
  ['] BRANCH, compile,
  HERE - , ; IMMEDIATE
: WHILE
  ['] BRANCH, compile,
  HERE swap 0 , ; IMMEDIATE
: REPEAT
  [']BRANCH, ,
  HERE swap - ,
  HERE over swap - swap ! ; IMMEDIATE
</pre>
</div>

<div class="org-src-container">
<pre class="src src-forth">: DO
  2&gt;R ; IMMEDIATE
: ?DO
  2dup &lt;&gt; ['] BRANCH, compile, HERE
  2&gt;R ; IMMEDIATE
: LOOP
  ;
: +LOOP
  ;
: LEAVE
  TODO ; IMMEDIATE
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c8b105" class="outline-3">
<h3 id="org1c8b105"><span class="section-number-3">1.7.</span> <span class="todo TODO">TODO</span> Comments</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-forth">: CHAR word' drop C@ ;
: [CHAR] char literal ; IMMEDIATE
</pre>
</div>

<div class="org-src-container">
<pre class="src src-forth">: \ begin key 10 = until ;
: ( begin key [char] ) = until ;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfdd8917" class="outline-2">
<h2 id="orgfdd8917"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Change</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://forth-standard.org/standard/doc">http://forth-standard.org/standard/doc</a>
</p>
<ul class="org-ul">
<li>Have a 'non-standard' but simpler Forth?</li>
<li>Forth requires max 31 chars for defn names, so we can simplify the dict</li>
<li>Document sec 4.1</li>
<li>Exns for ambiguous conds?</li>
</ul>
</div>
</div>
