stage1-forth-bytecode/stage1.org
* TODO Forth Assembler
** ;CODE
* TODO Ideas
- Server and client :: Have the C implementation be a REPL server,
     with separate messages, errors, and stack buffers?
  - Support for up/downloading 'images' (the dictionary?), and
    perhaps replace raspbootin?
- DMA Forth :: Do [[cite:runDMA][run-DMA] TODO this link
- [[Naming][Naming]] :: All the stack manipulation could be simplified by having
            names.
- [[PRF][Partial Recursive Functions (PRF)]] :: Perhaps could take inspiration
     from the way composition is implemented there, in order to avoid
     all the stack manipulation? This could be more in the Forth
     spirit than [[Naming][naming]].
- Dereference-count :: When a pointer gets dereferenced a lot, move
     its pointee closer to that pointer (when doing mark&move GC)? To
     make it more likely to be in the cache (akin to
     simulated-annealing in the connection machine).
- Simple JIT :: Inline all the non-recursive calls?
- Debugger :: Breakpoints and tracing?
- Exception aspects :: To decouple the 'textbook algorithm' from exception handling?
- SD Card read/store :: So that we can compile to/read from disk, and don't have to
- Memory management :: Simple bump allocator + GC? Might have to
     modify @ and ! for GC?

* TODO Naming
Plan is to extend forth to do naming, to make programs easier to
understand.

Doing this naively will probably result in a dynamic environment.

Something like
#+BEGIN_SRC forth
:fun REV-SUB ARG1 ARG2 => ARG2 ARG1 - ;
#+END_SRC
which could get turned into the equivalent of
#+BEGIN_SRC forth
: REV-SUB
  2 PUSH-STACK-FRAME
  2 FROM-FRAME
  1 FROM-FRAME
  -
  POP-FRAME
  ;
#+END_SRC
Also, I wonder if we need to redefine EXIT, for premature exits, or
perhaps have a trampoline take care of the push&pop, like so:
#+BEGIN_SRC asm
.fw SETUP
.fw P
.fw TEARDOWN
.fw EXIT
P:.fw BODY, ...
#+END_SRC

This might even lead to optimisations, e.g. to
#+BEGIN_SRC forth
: REV-SUB
  SWAP -
  ;
#+END_SRC

And arg-count checking, possibly only at runtime first, to make sure
we don't return multiple values or get too few arguments. Possibly
static-checking too?

* TODO Partial Recursive Functions (PRF) <<PRF>>
Perhaps turn something like
#+BEGIN_SRC forth
\ FOO ( A B C -- V W )
\ BAR ( E F -- X )
\ BAZ ( V W X -- M N O )
{ FOO , , BAR } BAZ
#+END_SRC
into
#+BEGIN_SRC forth
FOO >R
>R \ from the empty
BAR >R
R> R> R>
BAZ
#+END_SRC
* TODO Terminal on host with simple-forth.c?
First, define a protocol
- 0 n char0 ... charn ( send n chars )
- ?
* COMMENT Table column
#+BEGIN_EXPORT html
<script type="text/javascript">
  function openTab(event) {
    let open_index = 0;
    for (let el of event.target.parentElement.children) {
      if (el === event.target)
        break;
      ++open_index;
    }
    let table = event.target.
        parentElement.parentElement.parentElement;
    for (let tbody of table.getElementsByTagName("tbody")) {
      for (let row of tbody.children) {
        let index = 0;
        for (let data of row.children) {
          if (index == open_index) {
            for (element of data.children)
              element.style.display =
                  element.style.display === "none" ?
                  "block" : "none";
          }
          ++index;
        }
      }
    }
  }

  for (let element of document.getElementsByClassName("harmonica-table")) {
    for (let theads of element.getElementsByTagName("thead")) {
      for (let row of theads.children) {
        let index = 0;
        for (let data of row.children) {
          data.addEventListener(
            "click", openTab);
        }
        ++index;
      }
    }
  }
</script>
#+END_EXPORT
