stage1-forth-bytecode/stage1.html
<div id="outline-container-orgadee56a" class="outline-2">
<h2 id="orgadee56a"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> Testing</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>SOURCE-ID</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgc4b9ace" class="outline-2">
<h2 id="orgc4b9ace"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> After REPL</h2>
</div>

<div id="outline-container-org41bc4b6" class="outline-2">
<h2 id="org41bc4b6"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Forth Assembler</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org747731c" class="outline-3">
<h3 id="org747731c"><span class="section-number-3">5.1.</span> ;CODE</h3>
</div>
</div>
<div id="outline-container-org6832c89" class="outline-2">
<h2 id="org6832c89"><span class="section-number-2">6.</span> <span class="todo TODO">TODO</span> Ideas</h2>
<div class="outline-text-2" id="text-6">
<dl class="org-dl">
<dt>Server and client</dt><dd>Have the C implementation be a REPL server,
with separate messages, errors, and stack buffers?
<ul class="org-ul">
<li>Support for up/downloading 'images' (the dictionary?), and
perhaps replace raspbootin?</li>
</ul></dd>
<dt>DMA Forth</dt><dd>Do [[cite:runDMA][run-DMA] TODO this link</dd>
<dt><a href="#org10ef4c8">Naming</a></dt><dd>All the stack manipulation could be simplified by having
names.</dd>
<dt><a href="#orgfa8afc3">Partial Recursive Functions (PRF)</a></dt><dd>Perhaps could take inspiration
from the way composition is implemented there, in order to avoid
all the stack manipulation? This could be more in the Forth
spirit than <a href="#org10ef4c8">naming</a>.</dd>
<dt>Dereference-count</dt><dd>When a pointer gets dereferenced a lot, move
its pointee closer to that pointer (when doing mark&amp;move GC)? To
make it more likely to be in the cache (akin to
simulated-annealing in the connection machine).</dd>
<dt>Simple JIT</dt><dd>Inline all the non-recursive calls?</dd>
<dt>Debugger</dt><dd>Breakpoints and tracing?</dd>
<dt>Exception aspects</dt><dd>To decouple the 'textbook algorithm' from exception handling?</dd>
<dt>SD Card read/store</dt><dd>So that we can compile to/read from disk, and don't have to</dd>
<dt>Memory management</dt><dd>Simple bump allocator + GC? Might have to
modify @ and ! for GC?</dd>
</dl>
</div>
</div>

<div id="outline-container-org10ef4c8" class="outline-2">
<h2 id="org10ef4c8"><span class="section-number-2">7.</span> <span class="todo TODO">TODO</span> Naming</h2>
<div class="outline-text-2" id="text-7">
<p>
Plan is to extend forth to do naming, to make programs easier to
understand.
</p>

<p>
Doing this naively will probably result in a dynamic environment.
</p>

<p>
Something like
</p>
<div class="org-src-container">
<pre class="src src-forth">:fun REV-SUB ARG1 ARG2 =&gt; ARG2 ARG1 - ;
</pre>
</div>
<p>
which could get turned into the equivalent of
</p>
<div class="org-src-container">
<pre class="src src-forth">: REV-SUB
  2 PUSH-STACK-FRAME
  2 FROM-FRAME
  1 FROM-FRAME
  -
  POP-FRAME
  ;
</pre>
</div>
<p>
Also, I wonder if we need to redefine EXIT, for premature exits, or
perhaps have a trampoline take care of the push&amp;pop, like so:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-keyword">.fw</span> SETUP
<span class="org-keyword">.fw</span> P
<span class="org-keyword">.fw</span> TEARDOWN
<span class="org-keyword">.fw</span> EXIT
<span class="org-function-name">P</span>:.fw BODY, ...
</pre>
</div>

<p>
This might even lead to optimisations, e.g. to
</p>
<div class="org-src-container">
<pre class="src src-forth">: REV-SUB
  SWAP -
  ;
</pre>
</div>

<p>
And arg-count checking, possibly only at runtime first, to make sure
we don't return multiple values or get too few arguments. Possibly
static-checking too?
</p>
</div>
</div>

<div id="outline-container-orgc555aea" class="outline-2">
<h2 id="orgc555aea"><span class="section-number-2">8.</span> <span class="todo TODO">TODO</span> Partial Recursive Functions (PRF) <a id="orgfa8afc3"></a></h2>
<div class="outline-text-2" id="text-8">
<p>
Perhaps turn something like
</p>
<div class="org-src-container">
<pre class="src src-forth">\ FOO ( A B C -- V W )
\ BAR ( E F -- X )
\ BAZ ( V W X -- M N O )
{ FOO , , BAR } BAZ
</pre>
</div>
<p>
into
</p>
<div class="org-src-container">
<pre class="src src-forth">FOO &gt;R
&gt;R \ from the empty
BAR &gt;R
R&gt; R&gt; R&gt;
BAZ
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb861b19" class="outline-2">
<h2 id="orgb861b19"><span class="section-number-2">9.</span> <span class="todo TODO">TODO</span> Terminal on host with simple-forth.c?</h2>
<div class="outline-text-2" id="text-9">
<p>
First, define a protocol
</p>
<ul class="org-ul">
<li>0 n char0 &#x2026; charn ( send n chars )</li>
<li>?</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert Kovacsics (rmk35)</p>
<p class="date">Created: 2022-01-02 Sun 02:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
